app/views/posts/show.html.erb

  <strong>Author Info:</strong>
  <%= User.find(@post.user_id).info %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]