app/controllers/chatrooms_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "guest_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["guest_id", 2], ["updated_at", "2016-04-29 09:11:02.524515"], ["id", 16]]
INSERT INTO "chatrooms" ("exists", "visited", "duration", "user_id", "guest_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["exists", "t"], ["visited", "f"], ["duration", 40], ["user_id", 1], ["guest_id", 2], ["created_at", "2016-04-29 16:09:27.552300"], ["updated_at", "2016-04-29 16:09:27.552300"]]
DELETE FROM "chatrooms" WHERE "chatrooms"."id" = ?  [["id", 1]]
---
  def create
    @post = Post.find(params[:post_id].to_i)
    @post.update(guest_id: params[:guest_id].to_i)
    @chatroom = Chatroom.new({ exists: to_boolean(params[:exists]), visited: false, duration: 2*params[:duration].to_i,
      user_id: @post.user_id, guest_id: params[:guest_id] })
    if @chatroom.save
      if(Chatroom.exists? (@chatroom.id-1) )
        Chatroom.destroy(@chatroom.id-1)

DELETE FROM "chatrooms" WHERE "chatrooms"."id" = ?  [["id", 12]]
---
  def destroy
    @chatroom.destroy

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_chatroom
      @chatroom = Chatroom.find(params[:id])