app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def create
    @group = Group.new(group_params)

    if @group.save
---
INSERT INTO "groups" ("name", "info", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "CIS196"], ["info", "The course."], ["created_at", "2016-03-28 19:50:26.889660"], ["updated_at", "2016-03-28 19:50:26.889660"]]

  def update
    if @group.update(group_params)
---
UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["name", "test!!"], ["updated_at", "2015-11-08 00:45:49.680295"], ["id", 2]]

  def destroy
    @group.destroy
---
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]

  def add_user
    @user = User.find(params[:user_id].to_i)
    @group = Group.find(params[:group_id].to_i)
    if !@group.users.exists?(@user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = ? AND "users"."id" = ? LIMIT 1  [["group_id", 1], ["id", 2]]

  def delete_user
    @group = Group.find(params[:group_id].to_i)
    if !@group.users.exists?(params[:user_id].to_i)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = ? AND "users"."id" = ? LIMIT 1  [["group_id", 2], ["id", 3]]
SELECT  1 AS one FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = ? AND "users"."id" = ? LIMIT 1  [["group_id", 2], ["id", 2]]

    def set_group
      @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 2]]