app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "author" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["author", "Matz"], ["updated_at", "2016-04-29 03:52:41.307929"], ["id", 2]]
INSERT INTO "posts" ("title", "content", "period", "user_id", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "Hi"], ["content", "Hi"], ["period", 20], ["user_id", 1], ["author", "Hannes"], ["created_at", "2016-04-28 22:31:56.370355"], ["updated_at", "2016-04-28 22:31:56.370355"]]
---
  def create
    @post = Post.new(post_params)
    @user = User.find(current_user.id)
    @post.update(user_id: current_user.id)
    @post.author = current_user.name
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "guest_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["guest_id", 2], ["updated_at", "2016-04-29 03:37:16.198508"], ["id", 1]]
---
  def join
    @post = Post.find(params[:post_id])
    @post.update(guest_id: params[:guest_id].to_i)