app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "justin"]]
---
  def create
    @current_user = User.find_by(name: user_params[:name])