app/controllers/statuses_controller.rb

INSERT INTO "statuses" ("text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "hello world"], ["user_id", 1], ["created_at", "2015-11-07 19:47:47.274565"], ["updated_at", "2015-11-07 19:47:47.274565"]]
---
  def create
    @status = Status.new(status_params)

    if logged_in? && @status.save

UPDATE "statuses" SET "text" = ?, "updated_at" = ? WHERE "statuses"."id" = ?  [["text", "hello world!!"], ["updated_at", "2015-11-07 19:57:11.425404"], ["id", 2]]
---
  def update
    if @status.update(status_params)

DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 3]]
---
  def destroy
    @status.destroy

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_status
      @status = Status.find(params[:id])