app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 1
---
  def index
    @users = User.all

INSERT INTO "users" ("name", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "DHH"], ["password_hash", "$2a$10$YaYuyVilvyN3NYA9gu/gheS3dGM7Z7Yxupq8fydW1sLDDHTLj0Op2"], ["created_at", "2016-03-28 16:38:52.082971"], ["updated_at", "2016-03-28 16:38:52.082971"]]
---
  def create
    @user = User.new(user_params)
    @user.password = user_params[:password]
    if @user.save

UPDATE "users" SET "name" = ?, "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "justin!"], ["password_hash", "$2a$10$PQTXnG8WP6EitBZQwIMjKOsoNCJyZKOtSUs0FyUtmuVE44hQHhUIi"], ["updated_at", "2015-11-07 23:11:44.202597"], ["id", 1]]
---
  def update
    if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    if current_user.id == @user.id
      reset_session
    end
    @user.destroy